//declare -A dictionary=(
//    ["Ч"]="Ch"
//    ["Ш"]="Sh"
//    ["Щ"]="Sht"
//    ["Ю"]="Yu"
//    ["Я"]="Ya"
//    ["Ж"]="Zh" 
//    ["А"]="A"
//    ["Б"]="B"
//    ["В"]="V"
//    ["Г"]="G"
//    ["Д"]="D"
//    ["Е"]="E"
//    ["З"]="Z"
//    ["И"]="I"
//    ["Й"]="Y"
//    ["К"]="K"
//    ["Л"]="L"
//    ["М"]="M"
//    ["Н"]="N"
//    ["О"]="O"
//    ["П"]="P"
//    ["Р"]="R"
//    ["С"]="S"
//    ["Т"]="T"
//    ["У"]="U"
//    ["Ф"]="F"
//    ["Х"]="H"
//    ["Ц"]="C"
//    ["Ъ"]="A"
//    ["Ь"]="I"
//    ["Ы"]="I"
//    ["Ё"]="Yo"
//    ["Э"]="E"
//)

use phf::phf_map;

static CYRILIC_TO_LATIN: phf::Map<&'static str, &'static str> = phf_map! {
    "Ч" => "Ch",
    "Ш" => "Sh",
    "Щ" => "Sht",
    "Ю" => "Yu",
    "Я" => "Ya",
    "Ж" => "Zh" ,
    "А" => "A",
    "Б" => "B",
    "В" => "V",
    "Г" => "G",
    "Д" => "D",
    "Е" => "E",
    "З" => "Z",
    "И" => "I",
    "Й" => "Y",
    "К" => "K",
    "Л" => "L",
    "М" => "M",
    "Н" => "N",
    "О" => "O",
    "П" => "P",
    "Р" => "R",
    "С" => "S",
    "Т" => "T",
    "У" => "U",
    "Ф" => "F",
    "Х" => "H",
    "Ц" => "C",
    "Ъ" => "A",
    "Ь" => "I",
    "Ы" => "I",
    "Ё" => "Yo",
    "Э" => "E",
};

pub fn filter( input: String ) {

}
